src/cf/src/AccumulationRegisters/ВзаиморасчётыСПоставщиками/ВзаиморасчётыСПоставщиками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВзаиморасчётыСПоставщиками</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>СуммаВВалюте</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыСКонтрагентами</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектРасчётов</name>
    <type>
      <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.КорректировкаДолга</types>
      <types>DocumentRef.РасходныйКассовыйОрдер</types>
      <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.ПриходныйКассовыйОрдер</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ПоступлениеДополнительныхРасходов</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      <types>DocumentRef.НалоговаяНакладнаяПокупка</types>
      <types>DocumentRef.ПоступлениеИзПереработки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/AccumulationRegisters/ТоварыВНаличии/ТоварыВНаличии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыВНаличии</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <attributes>
    <name>Комплект</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DefinedType.ПриходныйДокументПартии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаПартии</name>
    <comment>Реквизит для ускорения выборки по FIFO</comment>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/AccumulationRegisters/ДополнительныеРасходы/ДополнительныеРасходы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДополнительныеРасходы</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <attributes>
    <name>Комплект</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DefinedType.ПриходныйДокументПартии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяДДС</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/AccumulationRegisters/ТоварыВПереработке/ТоварыВПереработке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыВПереработке</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <comment>Переработчик, у которого находятся товары</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DefinedType.ПриходныйДокументПартии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаПартии</name>
    <comment>Реквизит для ускорения выборки по FIFO</comment>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПередачаВПереработку</name>
    <type>
      <types>DocumentRef.ПередачаВПереработку</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/AccumulationRegisters/ПотребностиПроизводства/ПотребностиПроизводства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПотребностиПроизводства</name>
  <resources>
    <name>Потребность</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <resources>
    <name>Заказано</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <resources>
    <name>Пришло</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <resources>
    <name>ИзОстатка</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Продукция</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Материал</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/CommonModules/УправляемыеБлокировки/Module.bsl
Процедура ВзаиморасчётыСКонтрагентамиПрочее(Блокировка, Контрагент) Экспорт
	Эл = Блокировка.Добавить("РегистрНакопления.ВзаиморасчётыСКонтрагентамиПрочие");
	Эл.Режим = РежимБлокировкиДанных.Исключительный;
	Эл.УстановитьЗначение("Контрагент", Контрагент);
КонецПроцедуры

Процедура ВзаиморасчётыСПокупателями(Блокировка, Контрагент) Экспорт
	Эл = Блокировка.Добавить("РегистрНакопления.ВзаиморасчётыСПокупателями");
	Эл.Режим = РежимБлокировкиДанных.Исключительный;
	Эл.УстановитьЗначение("Контрагент", Контрагент);
КонецПроцедуры

Процедура ВзаиморасчётыСПоставщиками(Блокировка, Контрагент) Экспорт
	Эл = Блокировка.Добавить("РегистрНакопления.ВзаиморасчётыСПоставщиками");
	Эл.Режим = РежимБлокировкиДанных.Исключительный;
	Эл.УстановитьЗначение("Контрагент", Контрагент);
КонецПроцедуры

Процедура ТоварыВНаличии(Блокировка, ИсточникДанных, МестоХранения = Неопределено) Экспорт
	Эл = Блокировка.Добавить("РегистрНакопления.ТоварыВНаличии");
	Эл.Режим = РежимБлокировкиДанных.Исключительный;
	Эл.ИсточникДанных = ИсточникДанных;
	Если ЗначениеЗаполнено(МестоХранения) Тогда
		Эл.УстановитьЗначение("МестоХранения", МестоХранения);
	КонецЕсли;
	Эл.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");
	// Дополнительные расходы
	ДополнительныеРасходы(Блокировка, ИсточникДанных, МестоХранения);
КонецПроцедуры

Процедура ДополнительныеРасходы(Блокировка, ИсточникДанных, МестоХранения = Неопределено) Экспорт
	Эл = Блокировка.Добавить("РегистрНакопления.ДополнительныеРасходы");
	Эл.Режим = РежимБлокировкиДанных.Исключительный;
	Эл.ИсточникДанных = ИсточникДанных;
	Если ЗначениеЗаполнено(МестоХранения) Тогда
		Эл.УстановитьЗначение("МестоХранения", МестоХранения);
	КонецЕсли;	
	Эл.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");
КонецПроцедуры

Процедура ТоварыВПереработке(Блокировка, ИсточникДанных, Контрагент) Экспорт
	Эл = Блокировка.Добавить("РегистрНакопления.ТоварыВПереработке");
	Эл.Режим = РежимБлокировкиДанных.Исключительный;
	Эл.ИсточникДанных = ИсточникДанных;
	Эл.УстановитьЗначение("Контрагент", Контрагент);
	Эл.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");
КонецПроцедуры

// Исключительная блокировка потребностей производства по заказу клиента - до чтения остатков потребности
// (заказ поставщику, поступление, возврат) и до записи движений заказа. Заказ клиента берёт её после
// блокировки карт продукции (ТехнологическиеКарты.ЗаблокироватьКартыПродукции), закупки - вместе со
// складскими регистрами одним Заблокировать().
//
// Параметры:
//  Блокировка - БлокировкаДанных - блокировка, в которую добавляется элемент.
//  Заказ      - ДокументСсылка.ЗаказПокупателя - заказ клиента на производство.
//
Процедура ПотребностиПроизводства(Блокировка, Заказ) Экспорт
	Эл = Блокировка.Добавить("РегистрНакопления.ПотребностиПроизводства");
	Эл.Режим = РежимБлокировкиДанных.Исключительный;
	Эл.УстановитьЗначение("Заказ", Заказ);
КонецПроцедуры

// Блокировка потребностей производства заказа клиента, под который идёт закупка, и заказов прежних движений
// документа (перепроведение со сменой основания). Закупка без заказа клиента ничего не добавляет. Проведение
// проверяет, сформирована ли потребность, уже после блокировки.
//
// Параметры:
//  Блокировка - БлокировкаДанных - блокировка, в которую добавляется элемент.
//  ДокОбъект  - ДокументОбъект.ЗаказПоставщику, ДокументОбъект.ПоступлениеТоваровУслуг,
//               ДокументОбъект.ВозвратПоставщику - проводимый документ закупки.
//
Процедура ПотребностиПроизводстваЗакупки(Блокировка, ДокОбъект) Экспорт
	Потребности = РегистрыНакопления.ПотребностиПроизводства;
	Заказы = Потребности.ЗаказыДвиженийДокумента(ДокОбъект.Ссылка);
	Заказ = Потребности.ЗаказКлиентаДокументаЗакупки(ДокОбъект);
	ДокОбъект.ДополнительныеСвойства.Вставить(Потребности.ИмяСвойстваЗаказа(), Заказ);
	Если ЗначениеЗаполнено(Заказ) И Заказы.Найти(Заказ) = Неопределено Тогда
		Заказы.Добавить(Заказ);
	КонецЕсли;
	Для Каждого ЗаказДвижений Из Заказы Цикл
		ПотребностиПроизводства(Блокировка, ЗаказДвижений);
	КонецЦикла;
КонецПроцедуры
